{
  "nombre": "vacaciones",
  "width": "1312px",
  "height": "762px",
  "tooltips": [
    {
      "id": "inicio",
      "title": "Se crea una instancia del proceso \"Solicitud de Vacaciones\" cuando un empleado desea realizar el trámite de su derecho a vacaciones ante la empresa.",
      "top": "107px",
      "left": "95px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "consultarVacaciones",
      "title": "Esta tarea consiste en una consulta al ERP para obtener principalmente los días de vacaciones que el empleado tiene pendiente por disfrutar. Se logra un objeto de datos que contiene el NIT de la empresa,<br> la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones.",
      "top": "87px",
      "left": "187px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitarVacaciones",
      "title": "Esta tarea permite que el empleado formalice su solicitud de vacaciones ante la empresa. <br> El empleado indica la fecha de inicio de vacaciones, el total de días hábiles a tomar y/o el total de días en valor, el nombre de su jefe inmediato. El empleado completa la tarea confirmando los datos de su solicitud de vacaciones.",
      "top": "87px",
      "left": "346px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "verificarSolicitud",
      "title": "Esta tarea es una consulta al BRMS para procesar las políticas que determinó la empresa para procesar la solicitud de las vacaciones.  Regla No. 1 = La suma del \"total de días hábiles a tomar\" y el \"total de días en valor\" no debe ser mayor al \"total de días pendientes por disfrutar\" Regla No. 2 = La diferencia entre la \"fecha de inicio de vacaciones\" y la \"fecha de solicitud de vacaciones\" no debe ser inferior al número de \" días de anticipación para la solicitud de vacaciones\" estipulado por la empresa ",
      "top": "87px",
      "left": "510px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "revisarSolicitud",
      "title": "Esta tarea permite que el Jefe inmediato del empleado evalúe su solicitud de vacaciones. <br> El Jefe completa la tarea confirmando si \"Aprueba\" o \"Rechaza\" la Solicitud. En caso que la solicitud se rechace: el Jefe debe indicar por qué rechazó la solicitud de vacaciones en una sección de \"Observaciones\" del formulario.",
      "top": "345px",
      "left": "680px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "notificarRechazo",
      "title": "Esta tarea permite el envío de un correo electrónico como notificación al Empleado con las 'observaciones' sobre el rechazo de su solicitud. Se completa la tarea tras el envío exitoso del correo electrónico.",
      "top": "287px",
      "left": "933px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudRechazada",
      "title": "La instancia del proceso \"Solicitud de Vacaciones\" termina y como resultado del proceso se obtiene un objeto de datos \"Solicitud\" en estado \"Rechazado\".",
      "top": "310px",
      "left": "1090px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "notificarAprobacion",
      "title": "Esta tarea permite el envío de un correo electrónico como notificación al Empleado de la aprobación de su solicitud. Incluir \"observaciones\" es opcional.<br> Se completa la tarea tras el envío exitoso del correo electrónico.",
      "top": "397px",
      "left": "933px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudAprobada",
      "title": "La instancia del proceso \"Solicitud de Vacaciones\" termina y como resultado del proceso se obtiene un objeto de datos \"Solicitud\" en estado \"Aprobado\"..",
      "top": "420px",
      "left": "1090px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "reasignarSolicitud",
      "title": "Esta tarea permite que el \"Dueño del Proceso\" evalúe por qué no se ha procesado la solicitud de vacaciones del empleado y reasigne la solicitud hacia otro recurso (Jefe) dentro de la empresa si es necesario.",
      "top": "591px",
      "left": "683px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudReasignada",
      "title": "La instancia asociada al flujo de secuencia finaliza. El control de flujo pasa a la tarea \"Revisar Solicitud\"..",
      "top": "615px",
      "left": "840px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "aprueba",
      "title": "El control de flujo continúa por el camino \"no\" si la solicitud fue rechazada; continúa por el camino \"si\" cuando la solicitud fue aprobada.",
      "top": "365px",
      "left": "838px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },    
    {
      "id": "empleado",
      "title": "Representa el rol \"Empleado\" en la empresa.",
      "top": "100px",
      "left": "40px",
      "width": "24px",
      "height": "63px",
      "border-radius": "10px"
    },
    {
      "id": "jefe",
      "title": "Representa el rol \"Jefe\" en la empresa.",
      "top": "350px",
      "left": "40px",
      "width": "24px",
      "height": "63px",
      "border-radius": "10px"
    },
    {
      "id": "dueñoProceso",
      "title": "Representa el rol \"Dueño  del Proceso\" en la empresa.",
      "top": "580px",
      "left": "40px",
      "width": "24px",
      "height": "100px",
      "border-radius": "10px"
    },
    {
      "id": "procesoSolicitudVacaciones",
      "title": "El proceso \"Solicitud de Vacaciones\" permite a todo empleado realizar el trámite de su derecho a vacaciones ante la empresa.",
      "top": "300px",
      "left": "8px",
      "width": "28px",
      "height": "150px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudInicio",
      "title": "Objeto de datos que contiene el NIT de la empresa, la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones.",
      "top": "360px",
      "left": "218px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudAprobada",
      "title": "Objeto de datos que contiene el NIT de la empresa, la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones, la fecha de inicio de vacaciones, el total de días hábiles a tomar, el total de días en valor, el nombre de su jefe inmediato, la fecha de solicitud de vacaciones, resultado de la regla número 1, resultado de la regla número 2, el estado de la solicitud como \"Aprobado\", y observaciones son de carácter opcional.",
      "top": "608px",
      "left": "966px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudRechazada",
      "title": "Objeto de datos que contiene el NIT de la empresa, la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones, la fecha de inicio de vacaciones, el total de días hábiles a tomar, el total de días en valor, el nombre de su jefe inmediato, la fecha de solicitud de vacaciones, resultado de la regla número 1, resultado de la regla número 2, el estado de la solicitud como \"Rechazado\", y algunas observaciones.",
      "top": "101px",
      "left": "966px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudPreVerificación",
      "title": "Objeto de datos que contiene el NIT de la empresa, la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones, la fecha de inicio de vacaciones, el total de días hábiles a tomar, el total de días en valor, el nombre de su jefe inmediato, la fecha de solicitud de vacaciones.",
      "top": "360px",
      "left": "380px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudVerificado",
      "title": "Objeto de datos que contiene el NIT de la empresa, la identificación del empleado, la fecha de ingreso a la empresa, la fecha del último corte de vacaciones, el total de días pendientes por disfrutar, los días de anticipación para la solicitud de vacaciones, la fecha de inicio de vacaciones, el total de días hábiles a tomar, el total de días en valor, el nombre de su jefe inmediato, la fecha de solicitud de vacaciones, resultado de la regla número 1, resultado de la regla número 2.",
      "top": "360px",
      "left": "543px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    }    
  ]
}