{
  "nombre": "vacaciones",
  "width": "1312px",
  "height": "762px",
  "tooltips": [
    {
      "id": "inicio",
      "title": "Se crea una instancia del proceso \"Solicitud de Vacaciones\" cuando un empleado desea realizar el trámite de su derecho a vacaciones ante la empresa.",
      "top": "107px",
      "left": "95px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "consultarVacaciones",
      "title": "Se genera una tarea que permite al empleado consultar los días de vacaciones que tiene pendiente por disfrutar.<br>La consulta da a conocer sobre el empleado como mínimo la fecha de ingreso, la fecha del último corte, el total de días pendientes por disfrutar. Así, se crea el objeto de datos \"Vacaciones\".\nEl empleado completa la tarea indicando si continúa o no con su solicitud de vacaciones.",
      "top": "87px",
      "left": "187px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitarVacaciones",
      "title": "Se genera una tarea que permite al empleado formalizar su solicitud de vacaciones.<br>El empleado indica la fecha de inicio de vacaciones, el total de días hábiles a tomar y/o el total de días en valor, el nombre de su jefe inmediato. Así, se crea el objeto de datos \"Solicitud\".\nEl empleado completa la tarea confirmando los datos de su solicitud de vacaciones.",
      "top": "87px",
      "left": "346px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "verificarSolicitud",
      "title": "Se realiza una verificación automática de los requisitos de la solicitud de acuerdo a lo estipulado por la empresa dentro de los lineamientos del Ministerio del Trabajo consignados en el Código Sustantivo del Trabajo (C.S.T.)",
      "top": "87px",
      "left": "510px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "revisarSolicitud",
      "title": "Se genera una tarea para que el Jefe inmediato del empleado evalúe y apruebe o rechace la solicitud.<br>Los datos de la solicitud están consignados en el objeto de datos \"Solicitud\".<br>\nEl Jefe completa la tarea confirmando si \"Aprueba\" o \"Rechaza\" la Solicitud, en consecuencia el objeto de datos \"Solicitud\" es sujeto de la actualización de su estado (\"Aprobada\"/Rechazada\"). En caso que la solicitud sea rechazada el Jefe debe dejar consignado el por qué a manera de comentarios/observaciones como parte de la información del objeto de datos \"Solicitud\".",
      "top": "345px",
      "left": "680px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "notificarRechazo",
      "title": "Se genera una tarea que de manera automática entrega al Empleado las observaciones/comentarios sobre el rechazo de su Solicitud.\nSe completa la tarea tras generar la notificación.",
      "top": "287px",
      "left": "933px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudRechazada",
      "title": "La instancia del proceso \"Solicitud de Vacaciones\" termina y como resultado del proceso se obtiene un objeto de datos \"Solicitud\" en estado \"Rechazada\".",
      "top": "310px",
      "left": "1090px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "notificarAprobacion",
      "title": "Se genera una tarea que de manera automática comunica al Empleado que su Solicitud fue aprobada. Comentarios u Observaciones sobre esta decisión son opcionales.<br>Se completa la tarea tras generar la notificación.",
      "top": "397px",
      "left": "933px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudAprobada",
      "title": "La instancia del proceso \"Solicitud de Vacaciones\" termina y como resultado del proceso se obtiene un objeto de datos \"Solicitud\" en estado \"Aprobada\".",
      "top": "420px",
      "left": "1090px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "reasignarSolicitud",
      "title": "Se genera una tarea para que la Gerente Administrativa y Financiera de la empresa evalúe porqué no se ha procesado la solicitud de vacaciones del empleado y tome una acción final y definitiva sobre el particular. En caso de algún evento no superable con el Jefe inmediato la Gerente Administrativa y Financiera será responsable de reasignar la Solicitud hacia otro recurso (Jefe) dentro de la empresa y velar por una pronta respuesta. Una vez reasignada la tarea \"Revisar Solicitud\" se completa la tarea.",
      "top": "591px",
      "left": "683px",
      "width": "100px",
      "height": "80px",
      "border-radius": "10px"
    },
    {
      "id": "solicitudReasignada",
      "title": "La instancia asociada al flujo de secuencia iniciado desde el evento intermedio \"Tarea Atrasada\" pasando por la tarea \"Intervenir Solicitud\" termina. Sin embargo, La instancia del proceso \"Solicitud de Vacaciones\" continúa a la espera de completar la tarea \"Revisar Solicitud\".",
      "top": "615px",
      "left": "840px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },
    {
      "id": "aprueba",
      "title": "Se valida cuál fue la decisión del Jefe acerca de la Solicitud, ¿fue aprobada o rechazada?.",
      "top": "365px",
      "left": "838px",
      "width": "36px",
      "height": "36px",
      "border-radius": "30px"
    },    
    {
      "id": "empleado",
      "title": "Representa el rol \"Empleado\" en la empresa.",
      "top": "100px",
      "left": "40px",
      "width": "24px",
      "height": "63px",
      "border-radius": "10px"
    },
    {
      "id": "jefe",
      "title": "Representa el rol \"Jefe\" en la empresa.",
      "top": "350px",
      "left": "40px",
      "width": "24px",
      "height": "63px",
      "border-radius": "10px"
    },
    {
      "id": "dueñoProceso",
      "title": "Representa el rol \"Administrador del Proceso\" en la empresa.",
      "top": "580px",
      "left": "40px",
      "width": "24px",
      "height": "100px",
      "border-radius": "10px"
    },
    {
      "id": "procesoSolicitudVacaciones",
      "title": "El proceso \"Solicitud de Vacaciones\" permite a todo empleado realizar el trámite de su derecho a vacaciones ante la empresa.",
      "top": "300px",
      "left": "8px",
      "width": "28px",
      "height": "150px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudInicio",
      "title": "Atributos objeto \"Solicitud\": Empresa, identificación del empleado, fecha de ingreso a la empresa, fecha del último corte de vacaciones, total de días pendientes por disfrutar.",
      "top": "360px",
      "left": "218px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudAprobada",
      "title": "Atributos objeto \"Solicitud [aprobado]\": Empresa, identificación del empleado, fecha de ingreso a la empresa, fecha del último corte de vacaciones, total de días pendientes por disfrutar, días de anticipación para la solicitud de vacaciones, fecha de inicio de vacaciones, total de días hábiles a tomar, total de días en valor, nombre de su jefe inmediato, fecha de solicitud de vacaciones, resultado regla número 1, resultado regla número 2, Estado: aprobado, observaciones (opcional).",
      "top": "608px",
      "left": "966px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudRechazada",
      "title": "Atributos objeto \"Solicitud [rechazado]\": Empresa, identificación del empleado, fecha de ingreso a la empresa, fecha del último corte de vacaciones, total de días pendientes por disfrutar, días de anticipación para la solicitud de vacaciones, fecha de inicio de vacaciones, total de días hábiles a tomar, total de días en valor, nombre de su jefe inmediato, fecha de solicitud de vacaciones, resultado regla número 1, resultado regla número 2, Estado: rechazado, observaciones.",
      "top": "101px",
      "left": "966px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudPreVerificación",
      "title": "Atributos objeto \"Solicitud [pre-verificación]\": Empresa, identificación del empleado, fecha de ingreso a la empresa, fecha del último corte de vacaciones, total de días pendientes por disfrutar, días de anticipación para la solicitud de vacaciones.",
      "top": "360px",
      "left": "380px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    },
    {
      "id": "dataObjectSolicitudVerificado",
      "title": "Atributos objeto \"Solicitud [verificación]\": Empresa, identificación del empleado, fecha de ingreso a la empresa, fecha del último corte de vacaciones, total de días pendientes por disfrutar, días de anticipación para la solicitud de vacaciones, fecha de inicio de vacaciones, total de días hábiles a tomar, total de días en valor, nombre de su jefe inmediato, fecha de solicitud de vacaciones, resultado regla número 1, resultado regla número 2.",
      "top": "360px",
      "left": "543px",
      "width": "34px",
      "height": "48px",
      "border-radius": "10px"
    }    
  ]
}